# OmniclassCode Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..OmniclassCode Property
ParameterTypeId Class See Also
---
"OmniClass Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId OmniclassCode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OmniclassCode As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ OmniclassCode {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace